app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-09-13 16:48:57.195757"], ["updated_at", "2018-09-13 16:48:57.195757"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-09-13 16:48:57.198182"], ["updated_at", "2018-09-13 16:48:57.198182"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
    @song =  Song.new(title: song[0])
    @artist = Artist.find_or_create_by(name: song[1])